---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.SketchNonPlanarFreeForm
source: html/06676de7-fe5d-8f20-43b3-0a16d4e81356.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.SketchNonPlanarFreeForm Property

The selected free form rebar is not planar. Sketching it will discard the current geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchNonPlanarFreeForm { get; }
```